[
  {
    "username": "Rian",
    "slug": "promise-async-await",
    "title": "Promise Async Await, dan Ketika Dia Bertemu Looping Control Flow",
    "body": "Setiap developer JavaScript pasti akan berkenalan dengan yang namanya fitur JavaScript yang bernama Promise, Callback, dan Async Await. Ketiga fitur tersebut selalu dipakai ketika JavaScript perlu menjalankan eksekusi kode secara “asinkronus” ke dalam “event loop” dari proses utama JavaScript itu sendiri. Sistem Promise dan Callback ini membuat proses eksekusi di dalam “single thread” dari event loop JavaScript V8 engine tidak terjadi proses blocking. Dengan demikian, proses antrian eksekusi yang banyak, tidak menyebabkan sistem menjadi macet (not responding) di JavaScript engine tersebut. Contoh Promise yang sering kita temui adalah proses Fetch Http Request via network (istilah lain dari AJAX), proses baca tulis data, dan proses lain yang dibungkus oleh Promise dan Callback. Bahasan lebih detail tentang Promise, Callback, dan Async Await banyak sekali ditemui di internet, salah satunya pada tautan berikut ini.",
    "image": "https://miro.medium.com/v2/resize:fit:1100/format:webp/1*EtkNzpL8g7X6Zkj3cFEN7g.jpeg"
  },
  {
    "username": "Rian",
    "slug": "fitur-fitur-kunci-di-ecmascrip-2024",
    "title": "Fitur-Fitur Kunci di ECMAScript 2024",
    "body": "JavaScript memegang peran sentral sebagai bahasa pemrograman utama untuk pengembangan frontend maupun backend. Salah satu alasan utama di balik ketahanan dan popularitas JavaScript adalah evolusinya yang berkelanjutan, didorong oleh proses standardisasi yang cermat. Standar yang mendasari JavaScript dikenal sebagai ECMAScript (disingkat ES). Setiap tahun, komite teknis TC39, yang beranggotakan perwakilan dari berbagai perusahaan teknologi, bekerja untuk mengevaluasi proposal fitur-fitur baru dan menyempurnakan bahasa. Proses ini terdiri dari beberapa tahapan, mulai dari ide awal (Tahap 0) hingga persetujuan akhir dan inklusi dalam standar (Tahap 4). Rilis tahunan standar ECMAScript, seperti ES2023, ES2024, dan seterusnya, membawa serangkaian fitur baru yang memperkaya bahasa dan menawarkan cara-cara yang lebih efisien serta ekspresif bagi developer untuk menulis kode.ECMAScript 2024 mewakili langkah penting dalam evolusi ini. Standar yang dirilis pada pertengahan tahun 2024 ini membawa sejumlah fitur signifikan yang telah melewati proses evaluasi ketat dan siap untuk diimplementasikan serta digunakan dalam lingkungan produksi. Fitur-fitur ini dirancang untuk mengatasi tantangan umum dalam pengembangan modern, meningkatkan kejelasan kode, menyederhanakan tugas-tugas yang sebelumnya memerlukan boilerplate, dan bahkan memperkenalkan kapabilitas baru yang kuat.",
    "image": "https://miro.medium.com/v2/resize:fit:720/format:webp/1*mNKYKS9B-w-NwqPQz3q08A.png"
  },
  {
    "username": "Rian",
    "slug": "menyelami-dunia-http-request",
    "title": "Menyelami Dunia HTTP Request dalam JavaScript Menggunakan Axios",
    "body": "Setiap developer JavaScript pasti akan berkenalan dengan yang namanya fitur JavaScript yang bernama Promise, Callback, dan Async Await. Ketiga fitur tersebut selalu dipakai ketika JavaScript perlu menjalankan eksekusi kode secara “asinkronus” ke dalam “event loop” dari proses utama JavaScript itu sendiri. Sistem Promise dan Callback ini membuat proses eksekusi di dalam “single thread” dari event loop JavaScript V8 engine tidak terjadi proses blocking. Dengan demikian, proses antrian eksekusi yang banyak, tidak menyebabkan sistem menjadi macet (not responding) di JavaScript engine tersebut. Contoh Promise yang sering kita temui adalah proses Fetch Http Request via network (istilah lain dari AJAX), proses baca tulis data, dan proses lain yang dibungkus oleh Promise dan Callback. Bahasan lebih detail tentang Promise, Callback, dan Async Await banyak sekali ditemui di internet, salah satunya pada tautan berikut ini.",
    "image": "https://miro.medium.com/v2/resize:fit:720/format:webp/1*w2RF69dD9xGfE7q0KhKqpw.png"
  },
  {
    "username": "Rian",
    "slug": "javascript-dengan-temporal-api",
    "title": "Membangun Masa Depan Tanggal dan Waktu di JavaScript Dengan Temporal API",
    "body": "Dalam lanskap pengembangan perangkat lunak modern, penanganan tanggal dan waktu merupakan fondasi yang tak terhindarkan bagi hampir setiap aplikasi, dari sistem keuangan hingga platform media sosial, dari aplikasi penjadwalan hingga layanan analitik. Akurasi, keandalan, dan kemampuan untuk beroperasi secara global dengan mempertimbangkan zona waktu dan kalender yang beragam adalah persyaratan fundamental. Namun, sudah menjadi rahasia umum di kalangan pengembang JavaScript bahwa objek Date bawaan sering kali menjadi sumber kebingungan, bug, dan frustrasi yang signifikan. Didesain di era awal web dengan fokus yang lebih sederhana, Date memiliki kelemahan mendasar seperti mutabilitas yang tidak terduga, API yang membingungkan dan tidak konsisten, serta penanganan zona waktu yang rentan kesalahan dan ambigu. Mengembangkan fitur yang membutuhkan manipulasi tanggal dan waktu yang kompleks, seperti menghitung durasi lintas zona waktu atau menjadwalkan acara berulang dengan mempertimbangkan aturan kalender yang berbeda, sering kali memerlukan penggunaan library pihak ketiga atau penulisan kode boilerplate yang rawan kesalahan. Menyadari kebutuhan yang mendesak akan solusi yang lebih baik, komite teknis ECMAScript (TC39) telah mengembangkan proposal Temporal API. Temporal dirancang dari awal untuk menjadi API penanganan tanggal dan waktu yang komprehensif, immutable, eksplisit dalam representasi dan operasi, serta mampu menangani kerumitan dunia nyata seperti zona waktu IANA dan sistem kalender non-Gregorian dengan cara yang andal.",
    "image": "https://miro.medium.com/v2/resize:fit:720/format:webp/1*N7eSk0H82a46dqWq72GblA.png"
  },
  {
    "username": "Rian",
    "slug": "membatalkan-http-request",
    "title": "Membatalkan HTTP Request: Fetch API dengan AbortController vs Axios Cancel Token",
    "body": "Dalam pengembangan web modern, membatalkan HTTP request yang tidak diperlukan adalah kebutuhan kritis untuk: Mengoptimasi performa (mengurangi beban jaringan). Mencegah memory leak (terutama di Single Page Applications). Meningkatkan UX (misal: membatalkan request saat pengguna beralih halaman). Dua pendekatan utama: Fetch API dengan AbortController (native browser API). Axios dengan CancelToken (library eksternal). Membatalkan Request dengan Fetch API + AbortController AbortController adalah API browser yang menyediakan cara untuk membatalkan operasi asinkron seperti Fetch. Cara Kerja: Buat instance AbortController. Dapatkan signal dari controller. Teruskan signal ke Fetch request. Panggil controller.abort() untuk membatalkan. Implementasi Dasar",
    "image": "https://miro.medium.com/v2/resize:fit:720/format:webp/1*vLO5sqmSIMvPcga2ec3eSg.jpeg"
  },
  {
    "username": "Rian",
    "slug": "menguasai-asynchronous-javaScript",
    "title": "Menguasai Asynchronous JavaScript: Promise, Async/Await, dan Parallelisme",
    "body": "alam dunia pengembangan web modern, JavaScript telah menjadi tulang punggung untuk membangun aplikasi yang dinamis dan responsif. Salah satu aspek krusial yang membedakan JavaScript (khususnya di lingkungan browser dan Node.js) dari banyak bahasa pemrograman tradisional adalah model eksekusinya yang single-threaded namun memiliki kemampuan untuk menangani operasi asynchronous. Kemampuan ini sangat penting untuk tugas-tugas yang memakan waktu, seperti mengambil data dari API eksternal, membaca file, atau berinteraksi dengan database, tanpa memblokir eksekusi kode lainnya dan membuat aplikasi menjadi freeze atau tidak responsif. Memahami dan mengelola operasi asinkron adalah keterampilan fundamental bagi setiap pengembang JavaScript. Artikel ini akan membawa Anda dalam perjalanan mendalam untuk menguasai teknik-teknik kunci dalam penanganan asinkron di JavaScript modern. Kita akan memulai dengan memahami konsep dasar asinkron, kemudian menyelami Promises sebagai pondasi untuk manajemen kode asinkron yang lebih terstruktur, dilanjutkan dengan Async/Await sebagai sintaks gula (syntactic sugar) yang menyederhanakan pekerjaan dengan Promises, dan terakhir, kita akan mengeksplorasi cara menjalankan beberapa operasi asinkron secara paralel menggunakan **Promise.all()** dan **Promise.allSettled()**. Artikel ini ditujukan bagi Anda yang sudah memiliki pemahaman dasar tentang JavaScript dan ingin memperdalam pengetahuan tentang cara kerja dan praktik terbaik dalam menangani operasi asinkron untuk membangun aplikasi yang efisien, responsif, dan mudah dikelola.",
    "image": "https://miro.medium.com/v2/resize:fit:720/format:webp/1*jVsdplY6eb5FJ2RijJz7UQ.jpeg"
  }
]
